In [1]:
import pandas as pd

In [2]:
stddatacsv = pd.read_csv("stddatacsv.csv")
stddatacsv_df = pd.DataFrame(stddatacsv)
stddatacsv_df

   regno  name   phone address  fathers name    m1    m2    m3    m4
0  101.0  anand  999.0     hyd           NaN  87.0  55.0   NaN  44.0
1  105.0    aaa  555.0     vij           NaN  77.0  66.0  99.0  99.0
2  109.0    rrr  444.0     vik           NaN   NaN  78.0  88.0  88.0
3  107.0    sss  888.0     sec           NaN  69.0  85.0  58.0   NaN
4  201.0  anand  999.0     hyd           NaN  87.0  55.0   NaN  44.0
5    NaN    NaN    NaN     NaN           NaN   NaN   NaN   NaN   NaN
6  109.0    rrr  444.0     vik           NaN   NaN  78.0  88.0  88.0
7  105.0    aaa  555.0     vij           NaN  77.0  66.0  99.0  99.0
8  204.0    NaN  888.0     NaN           NaN  33.0  77.0  58.0   NaN
9  205.0    bbb  111.0     ant           NaN  77.0  88.0  99.0  99.0

In [3]:
# Drop columns where all values are NaN (i.e., completely empty columns)
stddatacsv_df.dropna(axis=1, how="all", inplace=True)
stddatacsv_df

   regno  name   phone address    m1    m2    m3    m4
0  101.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
1  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
2  109.0    rrr  444.0     vik   NaN  78.0  88.0  88.0
3  107.0    sss  888.0     sec  69.0  85.0  58.0   NaN
4  201.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
5    NaN    NaN    NaN     NaN   NaN   NaN   NaN   NaN
6  109.0    rrr  444.0     vik   NaN  78.0  88.0  88.0
7  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
8  204.0    NaN  888.0     NaN  33.0  77.0  58.0   NaN
9  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [4]:
# Drop rows where all values are NaN (i.e., completely empty rows)
stddatacsv_df.dropna(how="all", inplace=True)
stddatacsv_df

   regno  name   phone address    m1    m2    m3    m4
0  101.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
1  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
2  109.0    rrr  444.0     vik   NaN  78.0  88.0  88.0
3  107.0    sss  888.0     sec  69.0  85.0  58.0   NaN
4  201.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
6  109.0    rrr  444.0     vik   NaN  78.0  88.0  88.0
7  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
8  204.0    NaN  888.0     NaN  33.0  77.0  58.0   NaN
9  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [5]:
# Remove duplicate rows from the DataFrame, keeping only the first occurrence of each duplicate
stddatacsv_df.drop_duplicates(inplace=True)
stddatacsv_df

   regno  name   phone address    m1    m2    m3    m4
0  101.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
1  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
2  109.0    rrr  444.0     vik   NaN  78.0  88.0  88.0
3  107.0    sss  888.0     sec  69.0  85.0  58.0   NaN
4  201.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
8  204.0    NaN  888.0     NaN  33.0  77.0  58.0   NaN
9  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [6]:
# Count the number of missing (NaN) values in each column of the DataFrame
stddatacsv_df.isnull().sum()

regno      0
name       1
phone      0
address    1
m1         1
m2         0
m3         2
m4         2
dtype: int64

In [7]:
stddatacsv_df.address.isnull().sum()  # Count missing values in 'address' column

np.int64(1)

In [8]:
stddatacsv_df.address = stddatacsv_df.address.fillna(
    stddatacsv_df.address.mode()[0]
)  # Fill missing 'address' values with the mode (most frequent value)
stddatacsv_df.address.isnull().sum()

np.int64(0)

In [9]:
stddatacsv_df.m1 = stddatacsv_df.m1.fillna(
    round(stddatacsv_df.m1.mean(), 1)
)  # Fill missing 'm1' values with the mean rounded to 1 decimal place
stddatacsv_df.m3 = stddatacsv_df.m3.fillna(
    round(stddatacsv_df.m3.mean(), 1)
)  # Fill missing 'm3' values with the mean rounded to 1 decimal place
stddatacsv_df.m4 = stddatacsv_df.m4.fillna(
    round(stddatacsv_df.m4.mean(), 1)
)  # Fill missing 'm4' values with the mean rounded to 1 decimal place
stddatacsv_df[["m1", "m3", "m4"]].isnull().sum()

m1    0
m3    0
m4    0
dtype: int64

In [10]:
stddatacsv_df.isna().sum()

regno      0
name       1
phone      0
address    0
m1         0
m2         0
m3         0
m4         0
dtype: int64

In [11]:
stddatacsv_df

   regno  name   phone address    m1    m2    m3    m4
0  101.0  anand  999.0     hyd  87.0  55.0  80.4  44.0
1  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
2  109.0    rrr  444.0     vik  71.7  78.0  88.0  88.0
3  107.0    sss  888.0     sec  69.0  85.0  58.0  74.8
4  201.0  anand  999.0     hyd  87.0  55.0  80.4  44.0
8  204.0    NaN  888.0     hyd  33.0  77.0  58.0  74.8
9  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [12]:
stddatacsv_df.dropna(
    thresh=5, inplace=True
)  # If a row has 5 or fewer non-null values, it will be removed.
stddatacsv_df

   regno  name   phone address    m1    m2    m3    m4
0  101.0  anand  999.0     hyd  87.0  55.0  80.4  44.0
1  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
2  109.0    rrr  444.0     vik  71.7  78.0  88.0  88.0
3  107.0    sss  888.0     sec  69.0  85.0  58.0  74.8
4  201.0  anand  999.0     hyd  87.0  55.0  80.4  44.0
8  204.0    NaN  888.0     hyd  33.0  77.0  58.0  74.8
9  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [13]:
# Checks the columns 'm3' and 'm4' only.
# If either column has NaN, that entire row will be removed.
# All other columns are ignored for this operation.

stddatacsv_df.dropna(subset=["m3", "m4"], inplace=True)
stddatacsv_df

   regno  name   phone address    m1    m2    m3    m4
0  101.0  anand  999.0     hyd  87.0  55.0  80.4  44.0
1  105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
2  109.0    rrr  444.0     vik  71.7  78.0  88.0  88.0
3  107.0    sss  888.0     sec  69.0  85.0  58.0  74.8
4  201.0  anand  999.0     hyd  87.0  55.0  80.4  44.0
8  204.0    NaN  888.0     hyd  33.0  77.0  58.0  74.8
9  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [14]:
stddatacsv_df.drop(
    ["regno", "phone"], axis=1, inplace=True
)  # Drop 'regno' and 'phone' columns
stddatacsv_df

   name  address    m1    m2    m3    m4
0  anand     hyd  87.0  55.0  80.4  44.0
1    aaa     vij  77.0  66.0  99.0  99.0
2    rrr     vik  71.7  78.0  88.0  88.0
3    sss     sec  69.0  85.0  58.0  74.8
4  anand     hyd  87.0  55.0  80.4  44.0
8    NaN     hyd  33.0  77.0  58.0  74.8
9    bbb     ant  77.0  88.0  99.0  99.0